app/controllers/meals_controller.rb

  def index
    @centerDate = params[:d] ? Date.parse(params[:d]) : Date.today
    @left_meals = Meal.find_all_by_day(@centerDate - 1,
                              :conditions => ['user_id = ?', @user])
---
SELECT * FROM "meals" WHERE (user_id = 1) AND ("meals"."day" = '2010-04-19')

  def show
    @meal = Meal.find(params[:id])
---
SELECT * FROM "meals" WHERE ("meals"."id" = 44)

  def new
    @meal = Meal.new
    @meal.day = params[:day]
    @meal.recipe = Recipe.new
    @recipes = Recipe.find_all_by_user_id(current_user, :order => "upper(title) ASC")
---
SELECT * FROM "recipes" WHERE ("recipes"."user_id" = 1) ORDER BY upper(title) ASC

  def create
    @meal = Meal.new(params[:meal])
    @meal.recipe = Recipe.find(params[:recipe][:id]) unless params[:recipe].nil?
    @meal.user = current_user
    @meal.recipe.user = current_user unless @meal.recipe.nil?
    if @meal.save
      redirect_back :action => 'index'
    else
      @recipes = Recipe.find_all_by_user_id(current_user, :order => "upper(title) ASC")
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 29)
INSERT INTO "meals" ("updated_at", "recipe_id", "day", "user_id", "created_at") VALUES('2010-04-24 20:52:51', 29, '2010-04-18', 1, '2010-04-24 20:52:51')
INSERT INTO "recipes" ("updated_at", "title", "directions", "ingredients", "user_id", "created_at") VALUES('2010-05-01 00:40:33', 'bonotz et al', 'Make sure to cook the bonotz until they are full done. Bonotz are notoriously hard to cook to perfection.', 'seventeen bonotz', 3, '2010-05-01 00:40:33')
SELECT * FROM "recipes" WHERE ("recipes"."user_id" = 3) ORDER BY upper(title) ASC

  def destroy
    if Meal.find(params[:id]).destroy
---
DELETE FROM "meals" WHERE "id" = 5
SELECT * FROM "meals" WHERE ("meals"."id" = 5)

  def update
    @meal = Meal.find(params[:id])
    if @meal.update_attributes(params[:meal])
---
SELECT * FROM "meals" WHERE ("meals"."id" = 53)
UPDATE "meals" SET "day" = NULL, "updated_at" = '2010-04-27 01:25:05' WHERE "id" = 58