app/controllers/meals_controller.rb

SELECT * FROM "recipes" ORDER BY upper(title) ASC
---
  def new
    @meal = Meal.new
    @meal.day = params[:day]
    @meal.recipe = Recipe.new
    @recipes = Recipe.all(:order => "upper(title) ASC")

SELECT * FROM "recipes" ORDER BY upper(title) ASC
---
  def create
    @meal = Meal.new(params[:meal])
    @meal.recipe = Recipe.find(params[:recipe][:id]) unless params[:recipe].nil?
    @meal.user = current_user
    @meal.recipe.user = current_user unless @meal.recipe.nil?
    if(@meal.save)
      redirect_back :action => 'index'
    else
      @recipes = Recipe.all(:order => "upper(title) ASC")