app/controllers/recipes_controller.rb

  def index
    @user_recipes = Recipe.find_all_by_user_id(current_user,
                                            :order => "upper(title) ASC")

    @made_recipes = @user_recipes.select do |r|
---
SELECT * FROM "recipes" WHERE ("recipes"."user_id" = 1) ORDER BY upper(title) ASC
SELECT * FROM "recipes" ORDER BY created_at DESC

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 7)

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 34)

  def update
    @recipe = Recipe.find(params[:recipe][:id])
    if @recipe.update_attributes(params[:recipe])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 8)
UPDATE "recipes" SET "body" = 'Bake some ham with pineapples in the oven. It''s awesome. Woot woot!', "updated_at" = '2010-04-18 14:48:18' WHERE "id" = 8