app/controllers/users_controller.rb

  def index
    @users = User.find(:all,
                :conditions => ["username != :username", {:username => current_user.username}])
---
SELECT * FROM "users" WHERE (username != 'justinbach')

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "username", "password_salt", "password_hash", "email", "created_at") VALUES('2010-04-21 00:30:28', 'justinbach', 'a0d5e2aceffa5178aec0d0d2dc6e8655bac8f54f', '5e543927ac8b34d584b942548b1689eefaffaea5', 'justinbach@gmail.com', '2010-04-21 00:30:28')